package main

//主版本：主版本号(major)
//次版本号(minor),每次提交数值加二
//修订版本号(patch)修复时间:年月
var version string = "1.1000.202206"

//每次修订的版本，均由于下向上编写
//修订格式如下：
/***************************************************************
*版权所有 (C)2014,shen
*
*当前版本：主版本.此版本号
*作   者：git注册名
*完成日期：年月日
*
*修改内容：
*
***************************************************************/

/***************************************************************/
/***************靓丽的分割线，修订版本在下面编*********************/

/***************************************************************
*版权所有 (C)2014,shen
*
*当前版本：1.1000
*作   者：shen
*完成日期：20220919
*
*修改内容：
*	增加js出现异常时候以红色字体先到控制台中，所有异常信息都已WARN开头，加具体异常信息，加异常函数名。
*	删除无用的go文件
*	修改RemoveBeforeHour函数返回值，可以精确捕捉参数异常
***************************************************************/
